import {
  LearningSVG,
  PlanningSVG,
  SolutionSVG,
  TimeManageSVG,
  TeamWorkSVG,
  PrioritySVG,
} from "../../../../assets/svgIcons";

export const softSkillsData = [
  {
    id: `softSkillsData-${1}`,
    name: "مهارت در یادگیری",
    about: `یکی از مهم ترین مهارت ها در زندگی و کار ، مهارت داشتن در یادگیریه ، میزان توان من در یادگرفتن مهارت ها و دانش مختلف ، توان کلی من در"بهبود" رو شرح میده . تمرکز من بر روی کاهش زمان یادگیری و یادگیری عمیق تر بوده ، در برنامه نویسی تقریبا همه چیز رو با تجربه کردن یادگرفته ام تا علاوه بر تجربه ی واقعی یک تکنولوژی ، درک کلی از اون تکنولوژی رو با یک مثال واقعی تر در خودم ایجاد کنم`,
    icon: <LearningSVG />,
  },
  {
    id: `softSkillsData-${2}`,
    name: "برنامه ریزی ",
    about: `برنامه ریزی در واقع ، پیاده کردن اهداف بر روی کاغذه و صحیح ترین نحوه ی فکر کردن ، نوشتن افکاره ! دیدگاه من برای برنامه ریزی ، فقط برای طبقه بندی و ترتیب بندی اهداف و وظایف مختلف نیست . من از برنامه ریزی برای مدیریت کردن نقشه ی راه خودم استفاده میکنم ، تا هم بالاترین توان یادگیری رو حفظ کنم و هم اولویت بندی رو بتونم به شکل بصری برای خودم مشخص کنم`,
    icon: <PlanningSVG />,
  },
  {
    id: `softSkillsData-${3}`,
    name: "حل مسئله",
    about: `چالش اصلی ! جدای از استفاده از تجربه برای حل مسائل ، تمرکز من بر یادگیری الگوریتم و فلوچارت ، دیزاین پترن ها و روش های برنامه نویسی مختلف بوده ، من اعتقاد دارم که ابتدا با تقلید کردن مهارت به دست می یاد و بعد از استاد شدن در تقلید کردن ، میتونم روش های خودم رو ابداع کنم ،اما گاهی لازمه که خودمون رو با فکر کردن بر روی مسائل به چالش بکشیم `,
    icon: <SolutionSVG />,
  },
  {
    id: `softSkillsData-${4}`,
    name: "اولویت بندی",
    about: `ترکیب برنامه ریزی و مهارت در یادگیری زمانی معنا و مفهوم پیدا میکنه (مخصوصا در جهان برنامه نویسی) که اولویت بندی به طور صحیح اجرا بشه ، جهان برنامه نویسی بسیار گسترده ست ، چه در زمان یادگیری و چه در زمان انجام پروژه ، مهمه اولویت بندی ما ، انعطاف پذیری لازم برای انجام کار و یا یادگیری رو به ما بده تا در حین عمل ، هم دستاورد های قابل قبولی داشته باشیم ، هم درگیر چرخه ی بینهایت "کامل نیست" نشیم !`,
    icon: <PrioritySVG />,
  },
  {
    id: `softSkillsData-${5}`,
    name: "کارگروهی",
    about: `کار با گروه ، همیشه دستاورد های بهتری رو میتونه فراهم کنه ، چالش کار با یک گروه ، نیاز به مهارت هایی داره که در هیچ پکیج آموزشی زبان برنامه نویسی یاد نمیدن! لازمه ی همدلی ، احترام و درک مناسب ،توجه به نیاز های شخصی اعضای گروه ، باعث میشه یک گروه کار هایی انجام بده که هزاران نفر به تنهایی نمیتونند انجام بدن`,
    icon: <TeamWorkSVG />,
  },
  {
    id: `softSkillsData-${6}`,
    name: "مدیریت زمان",
    about: `با ارزش ترین منبعی که در اختیار ماست ، زمانه . مدیریت زمان بالاترین ارزش رو در هر حیطه ی شغلی و زندگی داره . ترکیبی از مهارت یادگیری ، اولویت بندی و برنامه ریزی ، کار گروهی و توان حل مسئله ، توان مدیریت زمان رو به من میده. من تلاش میکنم دستاورد به دست آمده در طول زمان رو تا حد ممکن بهینه و قابل قبول نگه دارم `,
    icon: <TimeManageSVG />,
  },
];
